## Introduction to Pandas

Pandas is a powerful and flexible open-source data analysis and data manipulation library for the python programming language.

## Why use pandas ?

- Ease of Use
- Data cleaning
- Data Analysis
- Integration

## Core Data Structures

1. Series
2. DataFrame

### 1. Series

A Series is a one dimensional labeled array capable of holding any data type.

In [1]:
import pandas as pd

# Creating a Series
data = pd.Series([10,20,30,40],index=['a','b','c','d'])
print(data)

a    10
b    20
c    30
d    40
dtype: int64

### 2. DataFrame

A DataFrame is a two dimensional , size-mutable and heterogeneous tabular data structure with labeled axes (rows and columns).

In [2]:
# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

## Basic Operations

### 1. Data Selection

- loc
- iloc

In [7]:
# Label based selection
data = df.loc[1]
print(data)

Name            Bob
Age              30
City    Los Angeles
Name: 1, dtype: object

In [6]:
# Position based selection
data = df.iloc[0]
print(data)

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

### 2. Data Cleaning

functions to handle missing data, duplicate data and data transformation.

In [8]:
# Handling missing data
df.dropna()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [9]:
# Removing duplicates
df.drop_duplicates()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

### 3. Data Aggregation

aggregation operations such as sum, mean and count to summarize data.

In [13]:
# Aggregating data
print(df.groupby('Name').sum())

         Age         City
Name
Alice     25     New York
Bob       30  Los Angeles
Charlie   35      Chicago